testTesults/stage_3/4_delete_wrk.txt
Running 2m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 4.174ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 4.059ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 3.862ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 3.716ms, rate sampling interval: 20ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.85ms   76.15ms   1.01s    98.43%
    Req/Sec     2.63k     0.94k   12.70k    73.44%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.35ms
 75.000%    5.54ms
 90.000%   12.08ms
 99.000%  436.73ms
 99.900%  951.29ms
 99.990%    1.00s 
 99.999%    1.01s 
100.000%    1.01s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.051     0.000000            1         1.00
       0.588     0.100000        80274         1.11
       0.966     0.200000       160560         1.25
       1.286     0.300000       240738         1.43
       1.712     0.400000       320822         1.67
       2.347     0.500000       401035         2.00
       2.781     0.550000       441228         2.22
       3.265     0.600000       481209         2.50
       3.859     0.650000       521341         2.86
       4.599     0.700000       561433         3.33
       5.539     0.750000       601608         4.00
       6.123     0.775000       621636         4.44
       6.823     0.800000       641625         5.00
       7.707     0.825000       661723         5.71
       8.863     0.850000       681706         6.67
      10.319     0.875000       701812         8.00
      11.159     0.887500       711850         8.89
      12.079     0.900000       721861        10.00
      13.055     0.912500       731897        11.43
      14.103     0.925000       741925        13.33
      15.247     0.937500       751938        16.00
      15.863     0.943750       756927        17.78
      16.527     0.950000       761958        20.00
      17.247     0.956250       766955        22.86
      18.095     0.962500       771961        26.67
      19.135     0.968750       776985        32.00
      19.759     0.971875       779465        35.56
      20.575     0.975000       781988        40.00
      21.839     0.978125       784470        45.71
      26.095     0.981250       786957        53.33
      93.119     0.984375       789463        64.00
     188.671     0.985938       790717        71.11
     289.279     0.987500       791971        80.00
     384.255     0.989062       793226        91.43
     468.735     0.990625       794478       106.67
     561.663     0.992188       795736       128.00
     608.767     0.992969       796355       142.22
     648.191     0.993750       796983       160.00
     693.247     0.994531       797609       182.86
     735.743     0.995313       798236       213.33
     784.895     0.996094       798864       256.00
     807.935     0.996484       799180       284.44
     826.367     0.996875       799492       320.00
     847.871     0.997266       799804       365.71
     873.471     0.997656       800116       426.67
     893.439     0.998047       800432       512.00
     904.703     0.998242       800587       568.89
     917.503     0.998437       800746       640.00
     928.767     0.998633       800909       731.43
     941.055     0.998828       801061       853.33
     952.319     0.999023       801216      1024.00
     957.439     0.999121       801292      1137.78
     962.047     0.999219       801371      1280.00
     967.167     0.999316       801454      1462.86
     972.287     0.999414       801530      1706.67
     976.383     0.999512       801603      2048.00
     980.479     0.999561       801647      2275.56
     984.575     0.999609       801686      2560.00
     988.159     0.999658       801720      2925.71
     991.743     0.999707       801765      3413.33
     994.815     0.999756       801801      4096.00
     995.839     0.999780       801819      4551.11
     997.375     0.999805       801841      5120.00
     998.399     0.999829       801860      5851.43
     999.423     0.999854       801878      6826.67
    1000.959     0.999878       801902      8192.00
    1001.471     0.999890       801909      9102.22
    1001.983     0.999902       801918     10240.00
    1003.007     0.999915       801930     11702.86
    1003.519     0.999927       801936     13653.33
    1004.543     0.999939       801948     16384.00
    1005.055     0.999945       801954     18204.44
    1005.567     0.999951       801959     20480.00
    1006.079     0.999957       801965     23405.71
    1006.079     0.999963       801965     27306.67
    1007.103     0.999969       801974     32768.00
    1007.103     0.999973       801974     36408.89
    1007.615     0.999976       801977     40960.00
    1007.615     0.999979       801977     46811.43
    1008.639     0.999982       801980     54613.33
    1009.151     0.999985       801983     65536.00
    1009.151     0.999986       801983     72817.78
    1009.663     0.999988       801987     81920.00
    1009.663     0.999989       801987     93622.86
    1009.663     0.999991       801987    109226.67
    1010.175     0.999992       801988    131072.00
    1010.687     0.999993       801990    145635.56
    1010.687     0.999994       801990    163840.00
    1010.687     0.999995       801990    187245.71
    1011.199     0.999995       801993    218453.33
    1011.199     0.999996       801993    262144.00
    1011.199     0.999997       801993    291271.11
    1011.199     0.999997       801993    327680.00
    1011.199     0.999997       801993    374491.43
    1011.199     0.999998       801993    436906.67
    1011.199     0.999998       801993    524288.00
    1011.199     0.999998       801993    582542.22
    1011.199     0.999998       801993    655360.00
    1011.199     0.999999       801993    748982.86
    1011.711     0.999999       801994    873813.33
    1011.711     1.000000       801994          inf
#[Mean    =       12.849, StdDeviation   =       76.146]
#[Max     =     1011.200, Total count    =       801994]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  899829 requests in 1.50m, 58.35MB read
Requests/sec:  10000.41
Transfer/sec:    664.09KB
Running 2m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 3.638ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 3.775ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 3.785ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 3.765ms, rate sampling interval: 18ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.64ms   39.27ms   1.00s    99.54%
    Req/Sec     2.63k     1.05k   11.22k    70.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.40ms
 75.000%    5.68ms
 90.000%   11.77ms
 99.000%   22.22ms
 99.900%  764.93ms
 99.990%  978.43ms
 99.999%    1.00s 
100.000%    1.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.055     0.000000            1         1.00
       0.594     0.100000        80096         1.11
       0.970     0.200000       160005         1.25
       1.299     0.300000       240047         1.43
       1.732     0.400000       320147         1.67
       2.401     0.500000       400015         2.00
       2.849     0.550000       440016         2.22
       3.349     0.600000       480014         2.50
       3.963     0.650000       519976         2.86
       4.727     0.700000       560038         3.33
       5.683     0.750000       600064         4.00
       6.279     0.775000       619960         4.44
       6.983     0.800000       639960         5.00
       7.839     0.825000       659960         5.71
       8.951     0.850000       679952         6.67
      10.255     0.875000       699992         8.00
      10.983     0.887500       709983         8.89
      11.767     0.900000       720051        10.00
      12.607     0.912500       730024        11.43
      13.495     0.925000       739976        13.33
      14.471     0.937500       749976        16.00
      14.999     0.943750       755004        17.78
      15.543     0.950000       759992        20.00
      16.127     0.956250       764954        22.86
      16.783     0.962500       770031        26.67
      17.519     0.968750       775015        32.00
      17.919     0.971875       777469        35.56
      18.383     0.975000       780021        40.00
      18.879     0.978125       782451        45.71
      19.471     0.981250       784969        53.33
      20.175     0.984375       787488        64.00
      20.591     0.985938       788731        71.11
      21.103     0.987500       789967        80.00
      21.727     0.989062       791214        91.43
      22.607     0.990625       792441       106.67
      24.175     0.992188       793691       128.00
      25.327     0.992969       794319       142.22
      27.311     0.993750       794946       160.00
      30.655     0.994531       795566       182.86
      40.223     0.995313       796189       213.33
     179.839     0.996094       796814       256.00
     269.055     0.996484       797127       284.44
     337.407     0.996875       797440       320.00
     423.423     0.997266       797751       365.71
     506.623     0.997656       798064       426.67
     586.239     0.998047       798376       512.00
     618.495     0.998242       798533       568.89
     654.335     0.998437       798690       640.00
     696.831     0.998633       798845       731.43
     730.623     0.998828       799002       853.33
     770.559     0.999023       799157      1024.00
     794.111     0.999121       799236      1137.78
     816.639     0.999219       799315      1280.00
     837.631     0.999316       799392      1462.86
     861.695     0.999414       799471      1706.67
     885.759     0.999512       799549      2048.00
     897.023     0.999561       799587      2275.56
     908.799     0.999609       799626      2560.00
     921.087     0.999658       799665      2925.71
     933.375     0.999707       799705      3413.33
     945.151     0.999756       799744      4096.00
     951.295     0.999780       799764      4551.11
     955.391     0.999805       799782      5120.00
     961.535     0.999829       799802      5851.43
     967.167     0.999854       799822      6826.67
     973.311     0.999878       799842      8192.00
     976.383     0.999890       799852      9102.22
     978.943     0.999902       799860     10240.00
     982.015     0.999915       799870     11702.86
     985.087     0.999927       799880     13653.33
     988.159     0.999939       799890     16384.00
     989.695     0.999945       799895     18204.44
     991.231     0.999951       799900     20480.00
     992.767     0.999957       799905     23405.71
     994.303     0.999963       799910     27306.67
     995.839     0.999969       799914     32768.00
     996.863     0.999973       799918     36408.89
     997.375     0.999976       799919     40960.00
     997.887     0.999979       799921     46811.43
     998.911     0.999982       799924     54613.33
     999.423     0.999985       799926     65536.00
     999.935     0.999986       799928     72817.78
    1000.447     0.999988       799929     81920.00
    1000.959     0.999989       799931     93622.86
    1000.959     0.999991       799931    109226.67
    1001.471     0.999992       799932    131072.00
    1001.983     0.999993       799934    145635.56
    1001.983     0.999994       799934    163840.00
    1001.983     0.999995       799934    187245.71
    1002.495     0.999995       799936    218453.33
    1002.495     0.999996       799936    262144.00
    1002.495     0.999997       799936    291271.11
    1002.495     0.999997       799936    327680.00
    1002.495     0.999997       799936    374491.43
    1003.007     0.999998       799938    436906.67
    1003.007     1.000000       799938          inf
#[Mean    =        6.644, StdDeviation   =       39.269]
#[Max     =     1002.496, Total count    =       799938]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  899973 requests in 1.50m, 58.36MB read
Requests/sec:   9999.88
Transfer/sec:    664.05KB
Running 2m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 3.310ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 3.394ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 3.465ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 3.493ms, rate sampling interval: 19ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.25ms    4.75ms  50.72ms   85.14%
    Req/Sec     2.63k     1.08k    7.42k    68.23%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.27ms
 75.000%    5.54ms
 90.000%   11.65ms
 99.000%   19.61ms
 99.900%   30.45ms
 99.990%   41.60ms
 99.999%   49.63ms
100.000%   50.75ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.056     0.000000            3         1.00
       0.572     0.100000        80011         1.11
       0.946     0.200000       160059         1.25
       1.245     0.300000       240091         1.43
       1.667     0.400000       320068         1.67
       2.271     0.500000       400037         2.00
       2.711     0.550000       440107         2.22
       3.205     0.600000       480138         2.50
       3.805     0.650000       520036         2.86
       4.567     0.700000       560065         3.33
       5.539     0.750000       600006         4.00
       6.159     0.775000       620033         4.44
       6.895     0.800000       640025         5.00
       7.783     0.825000       660018         5.71
       8.935     0.850000       680089         6.67
      10.231     0.875000       700008         8.00
      10.927     0.887500       710071         8.89
      11.655     0.900000       720073        10.00
      12.423     0.912500       730106        11.43
      13.231     0.925000       740006        13.33
      14.103     0.937500       750076        16.00
      14.559     0.943750       755031        17.78
      15.039     0.950000       760013        20.00
      15.543     0.956250       765003        22.86
      16.095     0.962500       770061        26.67
      16.687     0.968750       775060        32.00
      17.007     0.971875       777560        35.56
      17.343     0.975000       780010        40.00
      17.727     0.978125       782570        45.71
      18.127     0.981250       785048        53.33
      18.575     0.984375       787505        64.00
      18.847     0.985938       788789        71.11
      19.119     0.987500       790043        80.00
      19.423     0.989062       791291        91.43
      19.759     0.990625       792516       106.67
      20.159     0.992188       793784       128.00
      20.383     0.992969       794405       142.22
      20.639     0.993750       795007       160.00
      20.959     0.994531       795652       182.86
      21.295     0.995313       796258       213.33
      21.727     0.996094       796886       256.00
      22.031     0.996484       797206       284.44
      22.447     0.996875       797509       320.00
      23.183     0.997266       797819       365.71
      24.127     0.997656       798134       426.67
      25.439     0.998047       798441       512.00
      26.303     0.998242       798598       568.89
      27.263     0.998437       798754       640.00
      28.335     0.998633       798912       731.43
      29.407     0.998828       799066       853.33
      30.591     0.999023       799222      1024.00
      31.215     0.999121       799300      1137.78
      31.983     0.999219       799379      1280.00
      32.735     0.999316       799457      1462.86
      33.631     0.999414       799535      1706.67
      34.655     0.999512       799615      2048.00
      35.167     0.999561       799652      2275.56
      35.743     0.999609       799691      2560.00
      36.415     0.999658       799731      2925.71
      37.119     0.999707       799769      3413.33
      37.919     0.999756       799809      4096.00
      38.303     0.999780       799828      4551.11
      38.879     0.999805       799847      5120.00
      39.423     0.999829       799869      5851.43
      39.871     0.999854       799886      6826.67
      40.703     0.999878       799907      8192.00
      41.247     0.999890       799916      9102.22
      41.791     0.999902       799925     10240.00
      42.431     0.999915       799935     11702.86
      43.039     0.999927       799945     13653.33
      43.743     0.999939       799955     16384.00
      44.287     0.999945       799960     18204.44
      44.927     0.999951       799964     20480.00
      45.631     0.999957       799969     23405.71
      46.463     0.999963       799974     27306.67
      47.295     0.999969       799979     32768.00
      47.647     0.999973       799982     36408.89
      47.967     0.999976       799984     40960.00
      48.287     0.999979       799986     46811.43
      48.639     0.999982       799989     54613.33
      48.991     0.999985       799991     65536.00
      49.311     0.999986       799993     72817.78
      49.503     0.999988       799994     81920.00
      49.631     0.999989       799995     93622.86
      49.823     0.999991       799996    109226.67
      49.983     0.999992       799997    131072.00
      50.111     0.999993       799998    145635.56
      50.271     0.999994       799999    163840.00
      50.271     0.999995       799999    187245.71
      50.367     0.999995       800000    218453.33
      50.367     0.999996       800000    262144.00
      50.527     0.999997       800002    291271.11
      50.527     0.999997       800002    327680.00
      50.527     0.999997       800002    374491.43
      50.527     0.999998       800002    436906.67
      50.527     0.999998       800002    524288.00
      50.527     0.999998       800002    582542.22
      50.527     0.999998       800002    655360.00
      50.527     0.999999       800002    748982.86
      50.751     0.999999       800003    873813.33
      50.751     1.000000       800003          inf
#[Mean    =        4.250, StdDeviation   =        4.747]
#[Max     =       50.720, Total count    =       800003]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  899989 requests in 1.50m, 58.36MB read
Requests/sec:   9999.86
Transfer/sec:    664.05KB